files/emacs/init.org
#+TITLE: EMACS Config
#+PROPERTY: header-args :tangle ./init.el

* Bootstrap

#+begin_src emacs-lisp
  ;; bootstrap with straight.el
  (defvar bootstrap-version)
  (let ((bootstrap-file
         (expand-file-name
          "straight/repos/straight.el/bootstrap.el"
          (or (bound-and-true-p straight-base-dir)
              user-emacs-directory)))
        (bootstrap-version 7))
    (unless (file-exists-p bootstrap-file)
      (with-current-buffer
          (url-retrieve-synchronously
           "https://raw.githubusercontent.com/radian-software/straight.el/develop/install.el"
           'silent 'inhibit-cookies)
        (goto-char (point-max))
        (eval-print-last-sexp)))
    (load bootstrap-file nil 'nomessage))

  ;; avoid issues with different verion from org
  (straight-use-package '(org :type built-in))

  ;;  Effectively replace use-package with straight-use-package
  (straight-use-package 'use-package)
  (setq straight-use-package-by-default t)
#+end_src

* Optimizations
#+begin_src emacs-lisp
  (setq gc-cons-threshold 100000000)

  (setq read-process-output-max (* 1024 1024)) ;; 1mb
#+end_src
* Emacs Basic Editor Settings
** Custom Files
Set the default custom file

#+begin_src emacs-lisp
  (setq custom-file (expand-file-name "custom.el" user-emacs-directory))
  (when (file-exists-p custom-file) (load custom-file))
#+end_src

** Edit Settings

#+begin_src emacs-lisp
  (setq-default
   auto-save-default nil
   create-lockfiles nil
   column-number-mode t
   fill-column 80
   indent-tabs-mode nil
   make-backup-files nil)

  ;; broken automatically when the line becomes too wide
  (auto-fill-mode)

  ;; show line numbers
  (global-display-line-numbers-mode)

  ;; pair mode
  (electric-pair-mode)

  ;; enables highlighting for the current buffer
  (when window-system (global-hl-line-mode t))

  ;; auto refresh buffers when file changed on disk
  (global-auto-revert-mode t)
#+end_src

** Fonts

#+begin_src emacs-lisp
  (set-face-attribute 'default nil :font "JetBrainsMono Nerd Font" :height 140)
  (set-face-attribute 'fixed-pitch nil :font "JetBrainsMono Nerd Font" :height 140)
  (set-face-attribute 'variable-pitch nil :font "JetBrainsMono Nerd Font" :height 140)
#+end_src

** Quit

#+begin_src emacs-lisp
  (fset 'yes-or-no-p 'y-or-n-p)

  (setq confirm-kill-emacs 'yes-or-no-p)
#+end_src

* GUI frames
** Suppress GUI Features

#+begin_src emacs-lisp
  (setq inhibit-startup-message t) ;; Don't show the startup message
#+end_src

** Menu / Scrollbar

#+begin_src emacs-lisp
  (add-to-list 'default-frame-alist '(fullscreen . maximized)) ;; maximize window

  (menu-bar-mode -1)    ;; Disable menu bar
  (scroll-bar-mode -1)  ;; Disable visible scrollbar
  (tool-bar-mode -1)    ;; Disable the toolbar
  (tooltip-mode -1)     ;; Disable tooltips

  (set-fringe-mode 10)
#+end_src

* Packages
** Console
*** Load shell environment
A GNU Emacs library to ensure environment variables inside Emacs look the same as in the user's shell.

#+begin_src emacs-lisp
  (use-package exec-path-from-shell
    :config
    (exec-path-from-shell-initialize))
#+end_src

*** vterm
Emacs-libvterm (vterm) is fully-fledged terminal emulator inside GNU Emacs based
on libvterm, a C library. As a result of using compiled code (instead of elisp),
emacs-libvterm is fully capable, fast, and it can seamlessly handle large outputs.

#+begin_src emacs-lisp
  (use-package vterm)

  (use-package vterm-toggle
    :bind
      (("<M-f12>" . vterm-toggle)
        :map vterm-mode-map
        ("M-<" . vterm-toggle-forward)
        ("M->" . vterm-toggle-backward))
    :config
    (add-to-list 'display-buffer-alist
               '((lambda(bufname _) (with-current-buffer bufname (equal major-mode 'vterm-mode)))
                  (display-buffer-reuse-window display-buffer-at-bottom)
                  (direction . bottom)
                  (reusable-frames . visible)
                  (window-height . 0.3))))
#+end_src

** Completion/Search
*** corfu
Corfu enhances the default completion in region function with a completion overlay.

#+begin_src emacs-lisp
  (use-package emacs
   :init
   ;; TAB cycle if there are only few candidates
   (setq completion-cycle-threshold 3)

   ;; Enable indentation+completion using the TAB key.
   ;; `completion-at-point' is often bound to M-TAB.
   (setq tab-always-indent 'complete)

   ;; Emacs 30 and newer: Disable Ispell completion function. As an alternative,
   ;; try `cape-dict'.
   ;;(setq text-mode-ispell-word-completion nil)

   ;; Emacs 28 and newer: Hide commands in M-x which do not apply to the current
   ;; mode.  Corfu commands are hidden, since they are not used via M-x. This
   ;; setting is useful beyond Corfu.
   (setq read-extended-command-predicate #'command-completion-default-include-p))

  (use-package corfu
   ;; Optional customizations
   :custom
   ;; (corfu-cycle t)                ;; Enable cycling for `corfu-next/previous'
   (corfu-auto t)                 ;; Enable auto completion
   ;; (corfu-separator ?\s)          ;; Orderless field separator
   ;; (corfu-quit-at-boundary nil)   ;; Never quit at completion boundary
   ;; (corfu-quit-no-match nil)      ;; Never quit, even if there is no match
   ;; (corfu-preview-current nil)    ;; Disable current candidate preview
   ;; (corfu-preselect 'prompt)      ;; Preselect the prompt
   ;; (corfu-on-exact-match nil)     ;; Configure handling of exact matches
   ;; (corfu-scroll-margin 5)        ;; Use scroll margin

   ;; Enable Corfu only for certain modes.
   ;; :hook ((prog-mode . corfu-mode)
   ;;        (shell-mode . corfu-mode)
   ;;        (eshell-mode . corfu-mode))

   ;; Recommended: Enable Corfu globally.  This is recommended since Dabbrev can
   ;; be used globally (M-/).  See also the customization variable
   ;; `global-corfu-modes' to exclude certain modes.=
   :init
   (global-corfu-mode))
#+end_src

