files/emacs/init.org
*** rainbow-delimiters
Highlights parentheses, brackets, and braces according to their depth.

#+begin_src emacs-lisp
  (use-package rainbow-delimiters
    :hook
    (prog-mode . rainbow-delimiters-mode))
#+end_src

** File Manager
*** neotree
A Emacs tree plugin like NerdTree for Vim.

#+begin_src emacs-lisp
  (use-package neotree
    :config
    (global-set-key (kbd "<f8>") 'neotree-toggle)
    (global-set-key (kbd "M-<f8>") 'neotree-refresh))
#+end_src

** Interface Enhacement
*** dashboard
A startup dashboard which provides certain information about your recent Emacs activities.

#+begin_src emacs-lisp
  (use-package dashboard
    :straight
    (:host github :repo "emacs-dashboard/emacs-dashboard" :commit "a1c29c0bbfca3f6778022628b79e7eef2b9f351d")
    :config

    ;; list to show on dashboard
    (setq dashboard-items '((recents  . 5)
                            (projects . 5)
                            (agenda . 5)))

    ;; show icons
    (setq dashboard-set-heading-icons t)
    (setq dashboard-set-file-icons t)

    ;; change banner
    (setq dashboard-startup-banner 'logo)

    ;; Content is not centered by default. To center, set
    (setq dashboard-center-content nil)

    ;; vertically center content
    (setq dashboard-vertically-center-content nil)

    ;; start dashboard
    (dashboard-setup-startup-hook))
#+end_src

*** beacon
Whenever the window scrolls a light will shine on top of your cursor so you know where it is.

#+begin_src emacs-lisp
  (use-package beacon
    :config (beacon-mode))
#+end_src
** Log
*** command-log-mode
Show event history and command history of some or all buffers.

#+begin_src emacs-lisp
  (use-package command-log-mode
   :config
   (global-command-log-mode)
   :bind ("C-c o" . clm/toggle-command-log-buffer))
#+end_src
** Programming
*** emacs-gdb
#+begin_src emacs-lisp
  (use-package gdb-mi
  :straight (:host github :repo "weirdNox/emacs-gdb" :files ("*.el" "*.c" "*.h" "Makefile"))
  :init
  (fmakunbound 'gdb)
  (fmakunbound 'gdb-enable-debug))
#+end_src

*** flycheck
Flycheck is a modern on-the-fly syntax checking extension for GNU Emacs, intended
as replacement for the older Flymake extension which is part of GNU Emacs

#+begin_src emacs-lisp
  (use-package flycheck
    :config
    (add-hook 'after-init-hook #'global-flycheck-mode))
#+end_src

*** impatient
See the effect of your HTML as you type it.

#+begin_src emacs-lisp
  (use-package impatient-mode
    :commands impatient-mode)
#+end_src

**** Http Server
Start local server

#+begin_src emacs-lisp
  (use-package simple-httpd
    :config
    (setq httpd-port 7070)
    (setq httpd-host (system-name)))
#+end_src

*** lsp-ui

#+begin_src emacs-lisp
  (use-package lsp-ui)
#+end_src
*** lsp-mode
Client for Language Server Protocol (v3.14). lsp-mode aims to provide IDE-like
experience

#+begin_src emacs-lisp
  (use-package lsp-mode
    :custom
    (lsp-completion-provider :none) ;; we use Corfu!
    :init
    ;; set prefix for lsp-command-keymap (few alternatives - "C-l", "C-c l")
    (setq lsp-keymap-prefix "C-c l")

    (defun my/lsp-mode-setup-completion ()
      (setf (alist-get 'styles (alist-get 'lsp-capf completion-category-defaults))
            '(orderless))) ;; Configure orderless
    :config
    (define-key lsp-mode-map (kbd "C-c l") lsp-command-map)
    :hook (
           ;; if you want which-key integration
           (lsp-mode . lsp-enable-which-key-integration)
           (lsp-completion-mode . my/lsp-mode-setup-completion)

           (web-mode . lsp-deferred)
           (css-mode . lsp-deferred)
           (rust-mode . lsp-deferred)))
#+end_src

*** lispy
This package reimagines Paredit - a popular method to navigate and edit LISP code in Emacs.

#+begin_src emacs-lisp
  (use-package lispy)
#+end_src

*** yasnippet
YASnippet is a template system for Emacs. It allows you to type an abbreviation
and automatically expand it into function templates. Bundled language templates
include: C, C++, C#, Perl, Python, Ruby, SQL, LaTeX, HTML, CSS and more

#+begin_src emacs-lisp
    (use-package yasnippet
      :init
      (yas-global-mode 1))
#+end_src

** Programming Languages
*** Web Development
**** emmet
Emmet is a web-developer’s toolkit for boosting HTML & CSS code writing. With Emmet,
you can type expressions (abbreviations) similar to CSS selectors and convert them
into code fragment with a single keystroke.

#+begin_src emacs-lisp
  (use-package emmet-mode
    :after
    (web-mode css-mode))
#+end_src

**** web-mode
Major mode for editing various html templates.

#+begin_src emacs-lisp
  (use-package web-mode
    :mode
    (("\\.html?\\'" . web-mode))
    :config
    (setq web-mode-markup-indent-offset 2)
    (setq web-mode-css-indent-offset 2)
    (setq web-mode-code-indent-offset 2)
    (setq web-mode-enable-auto-expanding t)
    (setq web-mode-style-padding 2)
    (setq web-mode-script-padding 2)

    (setq web-mode-enable-current-column-highlight t)
    (setq web-mode-enable-current-element-highlight t)

    ;; integrated with emmet
    (add-hook 'web-mode-hook 'emmet-mode))
#+end_src

**** css configs

#+begin_src emacs-lisp
  (setq css-indent-level 2)
  (setq css-indent-offset 2)
#+end_src

**** tailwindcss

#+begin_src emacs-lisp
  (use-package lsp-tailwindcss
    :init
    (setq lsp-tailwindcss-add-on-mode t)
    :config
    ;; (add-hook 'before-save-hook 'lsp-tailwindcss-rustywind-before-save)
    (setq lsp-tailwindcss-major-modes '(web-mode html-mode sgml-mode css-mode rjsx-mode)))
#+end_src

**** prettier

#+begin_src emacs-lisp
  (use-package prettier
    :config
    (add-hook 'css-mode-hook 'prettier-mode)
    (add-hook 'js-mode-hook 'prettier-mode)
    (add-hook 'json-mode-hook 'prettier-mode)
    (add-hook 'web-mode-hook 'prettier-mode))
#+end_src

*** Javascript

#+begin_src emacs-lisp
  (use-package json-mode)
  ;;(use-package js2-mode)
  (use-package typescript-mode)

  (setq js-indent-level 2)
#+end_src

*** clojure
**** clojure-mode
clojure-mode is an Emacs major mode that provides font-lock (syntax highlighting),
indentation, navigation and refactoring support for the Clojure(Script) programming language.

#+begin_src emacs-lisp
  (use-package clojure-mode)
#+end_src

**** cider
CIDER is the Clojure(Script) Interactive Development Environment that Rocks!

#+begin_src emacs-lisp
  (use-package cider
    :config
    ;; disable cider showing eldoc during symbol at point
    (setq cider-eldoc-display-for-symbol-at-point nil)

    ;; go right to the REPL buffer when it's finished connecting
    (setq cider-repl-pop-to-buffer-on-connect t)

    ;; When there's a cider error, don't switch to the buffer
    (setq cider-show-error-buffer nil)
    (setq cider-auto-select-error-buffer nil))
#+end_src

**** clj-refactor
clj-refactor provides powerful refactoring functionality for Clojure projects.
It complements the refactoring functionality you'd find in clojure-mode and CIDER.

#+begin_src emacs-lisp
  (defun my-clojure-mode-hook ()
      (clj-refactor-mode 1)
      (yas-minor-mode 1) ; for adding require/use/import statements
      ;; This choice of keybinding leaves cider-macroexpand-1 unbound
      (cljr-add-keybindings-with-prefix "C-c C-m"))

  (use-package clj-refactor
    :config
    (setq cljr-warn-on-eval nil) ; disable warning
    (add-hook 'clojure-mode-hook #'my-clojure-mode-hook))
#+end_src

*** markdown

#+begin_src emacs-lisp
  (use-package markdown-mode
    :ensure t
    :commands (markdown-mode gfm-mode)
    :mode (("README\\.md\\'" . gfm-mode)
           ("\\.md\\'" . gfm-mode)
           ("\\.markdown\\'" . gfm-mode))
    :init (setq markdown-command "pandoc"))

  (defun fb/markdown-filter (buffer)
    (princ
     (with-temp-buffer
       (let ((tmp (buffer-name)))
         (set-buffer buffer)
         (set-buffer (markdown tmp))
         (format "<!DOCTYPE html><html><title>Markdown preview</title><link rel=\"stylesheet\" href = \"https://cdnjs.cloudflare.com/ajax/libs/github-markdown-css/5.5.1/github-markdown.min.css\"/>
  <body><article class=\"markdown-body\" style=\"box-sizing: border-box;min-width: 200px;max-width: 980px;margin: 0 auto;padding: 45px;\">%s</article></body></html>" (buffer-string))))
     (current-buffer)))

  (defun fb/markdown-preview ()
    "Preview markdown."
    (interactive)
    (unless (process-status "httpd")
      (httpd-start))
    (impatient-mode)
    (imp-set-user-filter 'fb/markdown-filter)
    (imp-visit-buffer))

  (defun fb/markdown-preview-stop ()
    "Stop preview"
    (interactive)
    (unless (process-status "httpd")
      (httpd-stop))
    (impatient-mode -1))
#+end_src

*** rust
**** rust-mode
rust-mode makes editing Rust code with Emacs enjoyable

#+begin_src emacs-lisp
  (defun my-cargo-run ()
    "Build and run Rust code."
    (interactive)
    (cargo-process-run)
    (let ((orig-win (selected-window))
          (run-win (display-buffer (get-buffer "*Cargo Run*") nil 'visible)))
      (select-window run-win)
      (comint-mode)
      (read-only-mode 0)
      (end-of-buffer)))

  (use-package rust-mode
    :config
    (setq rust-format-on-save t)

    ;;(add-hook 'rust-mode-hook (lambda () (prettify-symbols-mode)))

    (define-key rust-mode-map (kbd "C-c C-c C-q") 'my-cargo-run))
#+end_src

**** cargo
Emacs minor mode which allows to dynamically select a Cargo command.

#+begin_src emacs-lisp
  (use-package cargo
    :config
    (add-hook 'rust-mode-hook 'cargo-minor-mode)) 
#+end_src

**** flycheck-rust
This Flycheck extension configures Flycheck automatically for the current Cargo project.

#+begin_src emacs-lisp
  (use-package flycheck-rust
    :init
    (add-hook 'flycheck-mode-hook #'flycheck-rust-setup))
#+end_src

** Project management
*** projectile
For managing projects

#+begin_src emacs-lisp
  (use-package projectile
    :bind-keymap
    ("C-c p" . projectile-command-map)
    :config
    (projectile-mode 1))
#+end_src

** Themes
*** doom-modeline

#+begin_src emacs_lisp
  (use-package doom-modeline
    :init
    (doom-modeline-mode 1))
#+end_src

*** doom-themes

#+begin_src emacs-lisp
  (use-package doom-themes
    :config
    (load-theme 'doom-dracula t))
#+end_src

