files/emacs/init.el

(use-package rainbow-delimiters
  :hook
  (prog-mode . rainbow-delimiters-mode))

(use-package neotree
  :config
  (global-set-key (kbd "<f8>") 'neotree-toggle)
  (global-set-key (kbd "M-<f8>") 'neotree-refresh))

(use-package dashboard
  :straight
  (:host github :repo "emacs-dashboard/emacs-dashboard" :commit "a1c29c0bbfca3f6778022628b79e7eef2b9f351d")
  :config

  ;; list to show on dashboard
  (setq dashboard-items '((recents  . 5)
                          (projects . 5)
                          (agenda . 5)))

  ;; show icons
  (setq dashboard-set-heading-icons t)
  (setq dashboard-set-file-icons t)

  ;; change banner
  (setq dashboard-startup-banner 'logo)

  ;; Content is not centered by default. To center, set
  (setq dashboard-center-content nil)

  ;; vertically center content
  (setq dashboard-vertically-center-content nil)

  ;; start dashboard
  (dashboard-setup-startup-hook))

(use-package beacon
  :config (beacon-mode))

(use-package command-log-mode
 :config
 (global-command-log-mode)
 :bind ("C-c o" . clm/toggle-command-log-buffer))

(use-package flycheck
  :config
  (add-hook 'after-init-hook #'global-flycheck-mode))

(use-package impatient-mode
  :commands impatient-mode)

(use-package simple-httpd
  :config
  (setq httpd-port 7070)
  (setq httpd-host (system-name)))

(use-package lispy)

(use-package emmet-mode
  :after
  (web-mode css-mode))

(use-package web-mode
  :mode
  (("\\.html?\\'" . web-mode))
  :config
  (setq web-mode-markup-indent-offset 2)
  (setq web-mode-css-indent-offset 2)
  (setq web-mode-code-indent-offset 2)
  (setq web-mode-enable-auto-expanding t)
  (setq web-mode-style-padding 2)
  (setq web-mode-script-padding 2)

  (setq web-mode-enable-current-column-highlight t)
  (setq web-mode-enable-current-element-highlight t)

  ;; integrated with emmet
  (add-hook 'web-mode-hook 'emmet-mode))

(setq css-indent-level 2)
(setq css-indent-offset 2)

(use-package lsp-tailwindcss
  :init
  (setq lsp-tailwindcss-add-on-mode t)
  ;;:config
  ;;(add-hook 'before-save-hook 'lsp-tailwindcss-rustywind-before-save)
  )

(use-package prettier
  :config
  (add-hook 'css-mode-hook 'prettier-mode)
  (add-hook 'js-mode-hook 'prettier-mode)
  (add-hook 'json-mode-hook 'prettier-mode)
  (add-hook 'web-mode-hook 'prettier-mode))

(use-package json-mode)
;;(use-package js2-mode)
(use-package typescript-mode)

(setq js-indent-level 2)

(use-package clojure-mode)

(use-package cider
  :config
  ;; disable cider showing eldoc during symbol at point
  (setq cider-eldoc-display-for-symbol-at-point nil)

  ;; go right to the REPL buffer when it's finished connecting
  (setq cider-repl-pop-to-buffer-on-connect t)

  ;; When there's a cider error, don't switch to the buffer
  (setq cider-show-error-buffer nil)
  (setq cider-auto-select-error-buffer nil))

(defun my-clojure-mode-hook ()
    (clj-refactor-mode 1)
    (yas-minor-mode 1) ; for adding require/use/import statements
    ;; This choice of keybinding leaves cider-macroexpand-1 unbound
    (cljr-add-keybindings-with-prefix "C-c C-m"))

(use-package clj-refactor
  :config
  (setq cljr-warn-on-eval nil) ; disable warning
  (add-hook 'clojure-mode-hook #'my-clojure-mode-hook))

(use-package markdown-mode
  :ensure t
  :commands (markdown-mode gfm-mode)
  :mode (("README\\.md\\'" . gfm-mode)
         ("\\.md\\'" . gfm-mode)
         ("\\.markdown\\'" . gfm-mode))
  :init (setq markdown-command "pandoc"))

(defun fb/markdown-filter (buffer)
  (princ
   (with-temp-buffer
     (let ((tmp (buffer-name)))
       (set-buffer buffer)
       (set-buffer (markdown tmp))
       (format "<!DOCTYPE html><html><title>Markdown preview</title><link rel=\"stylesheet\" href = \"https://cdnjs.cloudflare.com/ajax/libs/github-markdown-css/5.5.1/github-markdown.min.css\"/>
<body><article class=\"markdown-body\" style=\"box-sizing: border-box;min-width: 200px;max-width: 980px;margin: 0 auto;padding: 45px;\">%s</article></body></html>" (buffer-string))))
   (current-buffer)))

(defun fb/markdown-preview ()
  "Preview markdown."
  (interactive)
  (unless (process-status "httpd")
    (httpd-start))
  (impatient-mode)
  (imp-set-user-filter 'fb/markdown-filter)
  (imp-visit-buffer))

(defun fb/markdown-preview-stop ()
  "Stop preview"
  (interactive)
  (unless (process-status "httpd")
    (httpd-stop))
  (impatient-mode -1))

(defun my-cargo-run ()
  "Build and run Rust code."
  (interactive)
  (cargo-process-run)
  (let ((orig-win (selected-window))
        (run-win (display-buffer (get-buffer "*Cargo Run*") nil 'visible)))
    (select-window run-win)
    (comint-mode)
    (read-only-mode 0)
    (end-of-buffer)))

(use-package rust-mode
  :config
  (setq rust-format-on-save t)

  ;;(add-hook 'rust-mode-hook (lambda () (prettify-symbols-mode)))

  (define-key rust-mode-map (kbd "C-c C-c C-q") 'my-cargo-run))

(use-package cargo
  :config
  (add-hook 'rust-mode-hook 'cargo-minor-mode))

(use-package flycheck-rust
  :init
  (add-hook 'flycheck-mode-hook #'flycheck-rust-setup))

(use-package projectile
  :bind-keymap
  ("C-c p" . projectile-command-map)
  :config
  (projectile-mode 1))

(use-package doom-modeline
  :init
  (doom-modeline-mode 1))

(use-package doom-themes
  :config
  (load-theme 'doom-dracula t))
