files/emacs/init.org
*** icons
Add icons to completion candidates using the built in completion metadata functions.

#+begin_src emacs-lisp
  (use-package nerd-icons
    :straight
    (nerd-icons :type git :host github :repo "rainstormstudio/nerd-icons.el")
    :custom
    ;; The Nerd Font you want to use in GUI
    ;; "Symbols Nerd Font Mono" is the default and is recommended
    ;; but you can use any other Nerd Font if you want
    (nerd-icons-font-family "Symbols Nerd Font Mono"))

    (use-package nerd-icons-completion
      :after
      (nerd-icons)
      :init
      (nerd-icons-completion-mode))
#+end_src

** Utilities
*** which-key
Displays the key bindings following your currently entered incomplete command (a prefix) in a popup

#+begin_src emacs-lisp
  (use-package which-key
    :init
    (which-key-mode)
    :config
    (setq which-key-idle-delay 0.3))
#+end_src

** Version control
*** Git

#+begin_src emacs-lisp
  (use-package magit)

  ;;(use-package  magit-delta
  ;;  :after (magit)
  ;;  :hook (magit-mode . magit-delta-mode))
#+end_src

** Window Frame Management
*** winner
Winner Mode is a global minor mode that allows you to “undo” and “redo” changes in WindowConfiguration

#+begin_src emacs-lisp
  (winner-mode 1)
#+end_src

** Org Mode

#+begin_src emacs-lisp
  (package-install 'org)

  (setq
   ;; Edit settings
   org-auto-align-tags nil
   org-tags-column 0
   org-catch-invisible-edits 'show-and-error
   org-confirm-babel-evaluate nil
   org-special-ctrl-a/e t
   org-startup-indented t
   org-startup-folded t
   ;;      org-startup-with-inline-images t
   org-insert-heading-respect-content t

   ;; Org styling, hide markup etc.
   org-hide-emphasis-markers t
   org-pretty-entities t
   org-ellipsis "…"

   ;; Agenda styling
   org-agenda-tags-column 0
   org-agenda-block-separator ?─
   org-agenda-time-grid
   '((daily today require-timed)
     (800 1000 1200 1400 1600 1800 2000)
     " ┄┄┄┄┄ " "┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄")
   org-agenda-current-time-string
   "◀── now ─────────────────────────────────────────────────")
#+end_src

*** org-download
#+begin_src emacs-lisp
  (use-package org-download
    :config
    (add-hook 'dired-mode-hook 'org-download-enable))
#+end_src

*** org-modern

#+begin_src emacs-lisp
  (use-package org-modern
    :config
    (add-hook 'org-mode-hook #'org-modern-mode)
    (add-hook 'org-agenda-finalize-hook #'org-modern-agenda))
#+end_src

*** org-roam

#+begin_src emacs-lisp
  (use-package org-roam
    :bind (("C-c n l" . org-roam-buffer-toggle)
           ("C-c n f" . org-roam-node-find)
           ("C-c n g" . org-roam-graph)
           ("C-c n i" . org-roam-node-insert)
           ("C-c n c" . org-roam-capture))
    :config
    (setq org-roam-directory (file-truename "~/.dotfiles/external_files/org"))
    (setq org-roam-completion-everywhere t)
    (org-roam-db-autosync-mode))

  (use-package org-roam-ui)
#+end_src
*** Auto tangle org file (save and load automatically)

# Local Variables:
# eval: (add-hook 'after-save-hook (lambda ()(when (y-or-n-p "Tangle?")(org-babel-tangle) (message "Reloading file") (load-file user-init-file))) nil t)
# End:



